app/Controllers/AdminController.php

    public function dosen_index()
    {
        $dosenModel = new DosenModel();
        $data = [
            'title' => 'Manajemen Dosen',
            'dosen_list' => $dosenModel->findAll()
---
SELECT *
FROM `dosen`