app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
SELECT COUNT(*) AS `numrows`
FROM `dosen`
SELECT COUNT(*) AS `numrows`
FROM `mata_kuliah`
---
    public function index()
    {
        $mahasiswaModel = new MahasiswaModel();
        $dosenModel = new DosenModel();
        $mataKuliahModel = new MataKuliahModel();

        $data = [
            'title' => 'Dashboard Admin',
            'total_mahasiswa' => $mahasiswaModel->countAllResults(),
            'total_dosen' => $dosenModel->countAllResults(),
            'total_matakuliah' => $mataKuliahModel->countAllResults()

SELECT *
FROM `mahasiswa`
ORDER BY `nama_mahasiswa` ASC
---
    public function mahasiswa_index()
    {
        $mahasiswaModel = new MahasiswaModel();
        $data = [
            'title' => 'Manajemen Mahasiswa',
            'mahasiswa_list' => $mahasiswaModel->orderBy('nama_mahasiswa', 'ASC')->findAll()

INSERT INTO `mahasiswa` (`nim`, `nama_mahasiswa`, `angkatan`) VALUES ('2358', 'dharma mahesa', '2022')
---
    public function mahasiswa_store()
    {
        $rules = [
            'nim' => 'required|is_unique[mahasiswa.nim]',
            'nama_mahasiswa' => 'required|min_length[3]',
            'angkatan' => 'required|integer|exact_length[4]'
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('validation', $this->validator);
        }
        $mahasiswaModel = new MahasiswaModel();
        $mahasiswaModel->save($this->request->getPost());