app/Controllers/DosenController.php

    public function index()
    {
        $matakuliahModel = new MataKuliahModel();
        $id_dosen = session()->get('id_dosen');

        $data = [
            'title' => 'Dashboard Dosen',
            // Kita tambahkan pengecekan di sini agar tidak error jika id_dosen null
            'total_matakuliah' => $id_dosen ? $matakuliahModel->where('id_dosen', $id_dosen)->countAllResults() : 0,
---
SELECT COUNT(*) AS `numrows`
FROM `mata_kuliah`
WHERE `id_dosen` = '2'

    public function kelas_detail($id_matkul)
    {
        $matakuliahModel = new MataKuliahModel();
        $rencanaStudiModel = new RencanaStudiModel();
        $id_dosen = session()->get('id_dosen');

        $matkul = $matakuliahModel->find($id_matkul);
---
SELECT *
FROM `mata_kuliah`
WHERE `mata_kuliah`.`id_matkul` = '2'

    public function input_nilai($id_matkul)
    {
        $matakuliahModel = new \App\Models\MataKuliahModel();
        $rencanaStudiModel = new \App\Models\RencanaStudiModel();
        $id_dosen = session()->get('id_dosen');

        // Verifikasi kepemilikan kelas
        $matkul = $matakuliahModel->find($id_matkul);
---
SELECT *
FROM `mata_kuliah`
WHERE `mata_kuliah`.`id_matkul` = '2'