app/Controllers/MahasiswaController.php

    public function rencanaStudi_index()
    {
        $rencanaStudiModel = new RencanaStudiModel();
        $id_mahasiswa = session()->get('id_mahasiswa');
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id_mahasiswa` = '4'

    public function rencanaStudi_create()
    {
        $mataKuliahModel = new MataKuliahModel();

        $data = [
            'title' => 'Tambah Mata Kuliah KRS',
            'matakuliah_list' => $mataKuliahModel->findAll()
---
SELECT *
FROM `mata_kuliah`

    public function rencanaStudi_store()
    {
        $rencanaStudiModel = new RencanaStudiModel();
        $id_mahasiswa = session()->get('id_mahasiswa');

        // Ambil ID mata kuliah yang dipilih dari form (diasumsikan berupa array checkbox)
        $matkul_ids = $this->request->getPost('matkul_ids');

        if (empty($matkul_ids)) {
            return redirect()->back()->with('error', 'Tidak ada mata kuliah yang dipilih.');
        }

        foreach ($matkul_ids as $id_matkul) {
            $data = [
                'id_mahasiswa' => $id_mahasiswa,
                'id_matkul' => $id_matkul,
                'tahun_akademik' => '2024/2025', // Bisa dibuat dinamis nanti
                'semester' => 'Genap'           // Bisa dibuat dinamis nanti
            ];
            // Menggunakan insert, akan gagal jika sudah ada (karena UNIQUE constraint di DB)
            // Ini mencegah duplikasi data
            try {
                $rencanaStudiModel->insert($data);
---
INSERT INTO `rencana_studi` (`id_mahasiswa`, `id_matkul`, `tahun_akademik`, `semester`) VALUES ('8', '1', '2024/2025', 'Genap')