app/Models/RencanaStudiModel.php

    public function getKrsByMahasiswa(int $id_mahasiswa)
    {
        // Menggunakan Query Builder untuk query yang lebih kompleks
        return $this->builder()

            // Pilih semua kolom dari 'rencana_studi' dan beberapa kolom dari 'mata_kuliah'
            ->select('rencana_studi.*, mata_kuliah.kode_matkul, mata_kuliah.nama_matkul, mata_kuliah.sks')

            // Gabungkan dengan tabel 'mata_kuliah' berdasarkan id_matkul
            ->join('mata_kuliah', 'mata_kuliah.id_matkul = rencana_studi.id_matkul', 'left')

            // Filter hasilnya HANYA untuk mahasiswa yang sedang login
            ->where('rencana_studi.id_mahasiswa', $id_mahasiswa)

            // Urutkan hasilnya berdasarkan nama mata kuliah
            ->orderBy('mata_kuliah.nama_matkul', 'ASC')

            // Eksekusi query dan kembalikan hasilnya sebagai array
            ->get()
            ->getResultArray();
---
SELECT `rencana_studi`.*, `mata_kuliah`.`kode_matkul`, `mata_kuliah`.`nama_matkul`, `mata_kuliah`.`sks`
FROM `rencana_studi`
LEFT JOIN `mata_kuliah` ON `mata_kuliah`.`id_matkul` = `rencana_studi`.`id_matkul`
WHERE `rencana_studi`.`id_mahasiswa` = 4
ORDER BY `mata_kuliah`.`nama_matkul` ASC