app/Models/RencanaStudiModel.php

SELECT `rencana_studi`.*, `mata_kuliah`.`kode_matkul`, `mata_kuliah`.`nama_matkul`, `mata_kuliah`.`sks`, `nilai`.`grade_huruf`, `mata_kuliah`.`hari`, `mata_kuliah`.`jam_mulai`, `mata_kuliah`.`jam_selesai`, `mata_kuliah`.`ruangan`
FROM `rencana_studi`
JOIN `mata_kuliah` ON `mata_kuliah`.`id_matkul` = `rencana_studi`.`id_matkul`
LEFT JOIN `nilai` ON `nilai`.`id_rs` = `rencana_studi`.`id_rs`
WHERE `rencana_studi`.`id_mahasiswa` = 4
ORDER BY `rencana_studi`.`tahun_akademik` ASC, `rencana_studi`.`semester` ASC
---
    public function getKHS(int $id_mahasiswa)
    {
        $rawData = $this->builder()
<<<<<<< HEAD
            ->select('rencana_studi.*,
                      mata_kuliah.kode_matkul, mata_kuliah.nama_matkul, mata_kuliah.sks,
                      mata_kuliah.hari, mata_kuliah.jam_mulai, mata_kuliah.jam_selesai, mata_kuliah.ruangan,
                      dosen.nama_dosen,
                      nilai.grade_huruf')
            ->join('mata_kuliah', 'mata_kuliah.id_matkul = rencana_studi.id_matkul')
            ->join('dosen', 'dosen.id_dosen = mata_kuliah.id_dosen', 'left') // JOIN DOSEN PENTING DI SINI
=======
            ->select('rencana_studi.*, mata_kuliah.kode_matkul, mata_kuliah.nama_matkul, mata_kuliah.sks, mata_kuliah.hari, mata_kuliah.jam_mulai, mata_kuliah.jam_selesai, mata_kuliah.ruangan, nilai.grade_huruf')
            ->join('mata_kuliah', 'mata_kuliah.id_matkul = rencana_studi.id_matkul')
>>>>>>> 5a738fe68a8fafe098f17057aeb31207d86c45ae
            ->join('nilai', 'nilai.id_rs = rencana_studi.id_rs', 'left')
            ->where('rencana_studi.id_mahasiswa', $id_mahasiswa)
            ->orderBy('rencana_studi.tahun_akademik, rencana_studi.semester', 'ASC')
            ->get()->getResultArray();