app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'budi'
 LIMIT 1
---
    public function getUserByUsername(string $username)
    {
        // Menggunakan Query Builder bawaan CodeIgniter Model
        // Sama dengan "SELECT * FROM users WHERE username = ? LIMIT 1"
        return $this->where('username', $username)->first();